In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\mehed\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\mehed\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mehed\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\mehed\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\mehed\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mehed\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd

In [8]:
import pandas as pd
x = ["Bangladesh", "AIU", "Malaysia"]
y = pd.Series(x)
y

0    Bangladesh
1           AIU
2      Malaysia
dtype: object

In [9]:
print(y[0])

Bangladesh

In [11]:
import pandas as pd
x = ["Bangladesh", "AIU", "Malaysia"]
y = pd.Series(x, index = ["a", "b", "c"])
print(y)

a    Bangladesh
b           AIU
c      Malaysia
dtype: object

In [12]:
print(y["b"])

AIU

In [19]:
data = {
    'Names' : ["Bangladesh", "AIU", "Malaysia"], 
    'Age' : [ 23 , 20 , 22 ] 
}

In [20]:
MyData = pd.DataFrame(data)

In [43]:
MyData

        Names  Age
0  Bangladesh   23
1         AIU   20
2    Malaysia   22

In [42]:
MyData.to_csv("AI.csv")

In [44]:
MyData2 = pd.read_csv("AI.csv")

In [45]:
MyData2

   Unnamed: 0       Names  Age
0           0  Bangladesh   23
1           1         AIU   20
2           2    Malaysia   22

In [62]:
MyData.to_csv("AI_no_index.csv",index = False)
MyData3 = pd.read_csv("AI_no_index.csv")

In [57]:
MyData3

        Names  Age
0  Bangladesh   23
1         AIU   20
2    Malaysia   22

In [71]:
customers=pd.read_csv("Mall_Customers.csv")

In [72]:
customers.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [73]:
customers.head(10)

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [74]:
customers.tail(5)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [86]:
customers.info()
print(customers)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB
     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [93]:
customers.shape
print(customers)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [106]:
customer_df = customers._append(customers)
customer_df.shape

(400, 5)